void CalError() {   //กำรคำนวณ Error
<<<<<<< HEAD
  ConvertADC();    //เปลี่ยนจาก analog เป็็น digital (สีดำ=0 สีขาว=1)
=======
  ConvertADC();    //เปลี่ยนจาก analog เป็น digital (สีดำ=0 สีขาว=1)
>>>>>>> 82b6c058a954de89a1cb70416bfec16374a5f2dd
  if ((L2 == 1) && (L1 == 1) && (C == 1) && (R1 == 1) && (R2 == 0)) Error = 4;
  else if ((L2 == 1) && (L1 == 1) && (C == 1) && (R1 == 0) && (R2 == 0)) Error = 3;
  else if ((L2 == 1) && (L1 == 1) && (C == 1) && (R1 == 0) && (R2 == 1)) Error = 2;
  else if ((L2 == 1) && (L1 == 1) && (C == 0) && (R1 == 0) && (R2 == 1)) Error = 1;
  else if ((L2 == 1) && (L1 == 1) && (C == 0) && (R1 == 1) && (R2 == 1)) Error = 0;
  else if ((L2 == 1) && (L1 == 0) && (C == 0) && (R1 == 1) && (R2 == 1)) Error = -1;
  else if ((L2 == 1) && (L1 == 0) && (C == 1) && (R1 == 1) && (R2 == 1)) Error = -2;
  else if ((L2 == 0) && (L1 == 0) && (C == 1) && (R1 == 1) && (R2 == 1)) Error = -3;
  else if ((L2 == 0) && (L1 == 1) && (C == 1) && (R1 == 1) && (R2 == 1)) Error = -4;
<<<<<<< HEAD
  // else if ((L2 == 1) && (L1 == 1) && (C == 1) && (R1 == 1) && (R2 == 1)) Error = 99;   //สิ้นสุดทาง
  else if ((L2 == 0) && (L1 == 0) && (C == 0) && (R1 == 0) && (R2 == 0)) Error = 100;     //แยก + T
  else if ((L2 == 0) && (L1 == 0) && (C == 0)) Error = 101;    //แยกซ้าย
  else if ((R1 == 0) && (R2 == 0) && (C == 0)) Error = 102;    //แยกขวา

=======
  else if ((L2 == 1) && (L1 == 1) && (C == 1) && (R1 == 1) && (R2 == 1)) Error = 99;   //สิ้นสุดทาง
  else if ((L2 == 0) && (L1 == 0) && (C == 0) && (R1 == 0) && (R2 == 0)) Error = 100;     //แยก + T
  else if ((L2 == 0) && (L1 == 0) && (C == 0)) Error = 101;    //แยกซ้าย
  else if ((R1 == 0) && (R2 == 0) && (C == 0)) Error = 102; //แยกขวา
>>>>>>> 82b6c058a954de89a1cb70416bfec16374a5f2dd
}
